first_routes_and_controllers/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Alice"], ["email", "idontno@nono.com.ru"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "ONE!!!"], ["email", "george@hotmail.com"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
  def destroy
    user = User.find(params[:id])
    if user.destroy